# -*- coding: utf-8 -*-
"""
   File name: ex_7.13.py
   
   *------------------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται ένα στοιχείο. Θα ελέγχει αν αυτό το στοιχείο υπάρχει μέσα σε μια πλειάδα και θα το 
   διαγράφει απ αυτήν (δημιουργώντας νέα πλειάδα με το ίδιο όνομα και ένα στοιχείο λιγότερο).
"""

stoixeio = eval(input("Δώσε στοιχείο: "))
tup = 'Στέργιος',6.67,20
tupList = list(tup)
for i in tup:
    if i == stoixeio:
        tupList.remove(i)
tup = tuple(tupList)
print(tup)        