# -*- coding: utf-8 -*-
"""
   File name: ex_7.19.py
   
   *------------------------------------------
   
   Να γράψετε πρόγραμμα που θα ζητάει δύο αριθμούς και θα αποθηκεύει σε πλειάδα όλους τους κοινούς διαιρέτες τους.
"""

num_01 = int(input("Δώσε έναν ακέραιο αριθμό: "))
num_02 = int(input("Δώσε έναν ακέραιο αριθμό: "))
l = list()
i = 1 
print("Κοινοί διαιρέτες των αριθμών",num_01,"και",num_02,":")
while(i < num_01 or i < num_02):
    if(num_01 % i == 0 and num_02 % i == 0 and i > 1):
        l.append(i)
    i += 1
tup = tuple(l)
print(tup)    