# -*- coding: utf-8 -*-
"""
   File name: ex_10.43.py
   
   *----------------------------------------------
   
   Να γράψετε συνάρτηση που θα δέχεται μια λίστα με n αριθμούς και θα υπολογίζει τον αρμονικό μέσο τους. Ο αρμονικός μέσος
   (harmonic mean) δίνεται από τον τύπο: 
                                 
                              H = n / Σ(i=1,n) (1/xi)
                              
   όπου xi είναι οι αριθμοί της λίστας.                           
"""

def armonikos_mesos(l):
    s = 0
    for i in range(len(l)):
        s += 1 / l[i]
    h = len(l) / s
    return h

l = [1,2,3,4,5]
arm = armonikos_mesos(l)
print("Ο αρμονικός μέσος της λίστας ισούται με",arm)    