# -*- coding: utf-8 -*-
"""
   File name: ex_10.14.py
   
   *--------------------------------------------
   
   Να γράψετε συνάρτηση που θα δέχεται δύο λίστες και θα επιστρέφει τιμή True ή False, αν η μία είναι υποσύνολο της άλλης.
"""


def subset(l,n):
    s_01 = set(l)
    s_02 = set(n)
    return s_01.issubset(s_02)



l_01 = [1,2,3]
l_02 = [1,2,3,4,5]
k = subset(l_01,l_02)
if k :
    print("Η λίστα",l_01,"είναι υποσύνολο της",l_02)
else:
    print("Η λίστα",l_01,"δεν είναι υποσύνολο της",l_02)    