# -*- coding: utf-8 -*-
"""
   File name: ex_10.21.py
   
   *-------------------------------------------------
   
   Να γράψετε δύο συναρτήσεις. Η μια θα δέχεται έναν αριθμό και η άλλη θα τοποθετεί αυτό τον αριθμό σε μια λίστα. Η 
   διαδικασία θα γίνεται επαναληπτικά και οι αριθμοί θα τοποθετούνται με τέτοιο τρόπο ώστε η λίστα να παραμένει ταξινομημένη.
   Δώστε ένα κριτήριο τερματισμού. 
"""

def readNum():
    n = eval(input("Δώσε έναν αριθμό: "))
    while n != 0:
     l = putToList(n)
     n = eval(input("Δώσε έναν αριθμό: "))
    return(l)
    
def putToList(n):
    l.append(n)
    l.sort()
    return(l)
        
l = list()
l = readNum()
print(l)    