# -*- coding: utf-8 -*-
"""
   File name: ex_10.26.py
   
   *---------------------------------------
   
   Να γράψετε μια συνάρτηση που θα ελέγχει αν ένας αριθμός είναι τέλειος. Ένας αριθμός x είναι τέλειος (perfect) αν είναι 
   ίσος με το άθροισμα των θετικών διαιρετών του, χωρίς να συμπεριλαμβάνεται σε αυτούς  ο ίδιος ο αριθμός x. Για παράδειγμα,
   το 6 είναι τέλειος αριθμός, αφού για x=6, οι διαιρέτες του είναι το 1, το 2 και το 3 (χωρίς το 6) και ισχύει 1 + 2 + 3 = 6.
"""

def numPerfect(n):
    l = list()
    for i in range(1,n-1):
        if n % i == 0:
            l.append(i)
    s = sum(l)
    if s == n:
     print("Ο αριθμός",n,"είναι τέλειος.")
    else:
     print("Ο αριθμός",n,"δεν είναι τέλειος.") 


x = int(input("Δώσε έναν αριθμό: "))
numPerfect(x)        