# -*- coding: utf-8 -*-
"""
   File name: ex_10.47.py
   
   *----------------------------------------------
   
   Να γράψετε συνάρτηση που θα δέχεται δέκα αριθμούς και θα υπολογίζει το διάστημα τιμών όπου ανήκουν κατά απόλυτη τιμή.
"""
from math import fabs

def diastima():
    l = list()
    for i in range(10):
        n = eval(input("Δώσε έναν αριθμό: "))
        l.append(fabs(n))
    print("Οι αριθμοί βρίσκονται στο διάστημα [",min(l),",",max(l),"].", sep ="")



diastima()          