# -*- coding: utf-8 -*-
"""
Created on Fri Jul 21 00:46:38 2023

   Να γράψετε συνάρτηση που θα δέχεται λίστα με n αριθμούς και θα υπολογίζει τον γεωμετρικό μέσο τους. Ο γεωμετρικός μέσος
   (geometric mean) δίνεται από τον τύπο:
       
                              G = (Π(i=1,n)xi)**1/n
                              
   όπου xi είναι οι αριθμοί της λίστας.                           
"""

import numpy


def g_mean(x):
    a = numpy.log(x)
    return numpy.exp(a.mean())

l = [1,4,7,6,6,4]
x = g_mean(l)
print("Ο γεωμετρικός μέσος της λίστας ισούται με",x)