# -*- coding: utf-8 -*-
"""
   File name: ex_10.28.py
   
   *------------------------------------
   
   Να γράψετε συνάρτηση που θα δέχεται έναν αριθμό και θα υπολογίζει αν αυτός είναι πρώτος. Ένας πρώτος (prime) αριθμός 
   διαιρείται μόνο με το 1 και τον εαυτό του.
"""

def isPrime(n):
    c = n-2
    for i in range(2,n):
        if n % i == 0:
            c += 1
    if c == n-2:
      print("Ο αριθμός",n,"είναι πρώτος.")
    else:
      print("Ο αριθμός",n,"δεν είναι πρώτος.")  

x = int(input("Δώσε έναν ακέραιο αριθμό: "))
isPrime(x)      