# -*- coding: utf-8 -*-
"""
   File name: ex_10.35.py
   
   *------------------------------------------------
   
   Υπολογίστε αναδρομικά την i-οστή δύναμη ενός αριθμού. Η συνάρτηση θα δέχεται δύο αριθμούς, τη βάση x και τον εκθέτη i, 
   επιστρέφοντας την δύναμη x**i.
"""

def power(a, b):
    if b != 0:
        return a * power(a, b - 1)
    else:
        return 1


a = int(input("Δώσε την βάση: "))
b = int(input("Δώσε τον εκθέτη: "))
print("Το",a, "στην", b, "είναι", power(a, b))