# -*- coding: utf-8 -*-
"""
   File name: ex_10.39.py
   
   *-----------------------------------------
   
   Για δοσμένο διάστημα [α,β], εμφανίατε όλους τους άρτιους αριθμούς αναδρομικά. 
"""

def is_even(k, n):
    if (n < k):
        return
    if (n % 2 == 0):
        is_even(k, n - 2)
    else:
        is_even(k, n - 1)
    if (n % 2 == 0):
        print(n, end = " ")
    
a = int(input("Δώσε αριθμό: "))
b = int(input("Δώσε αριθμό: "))
print("Στο διάστημα [",a,",",b,"] υπάρχουν οι παρακάτω άρτιοι αριθμοί:",sep = "")
is_even(a,b)    