# -*- coding: utf-8 -*-
"""
   File name: ex_10.51.py
   
   *---------------------------------------------------
   
   Ο τύπος ανατοκισμού ενός ποσού είναι:
       
                    K = P * ((1 + r) ** n)
   Να γράψετε συνάρτηση που θα δέχεται το ποσό (P), το επιτόκιο (r) και τα χρόνια n, επιστρέφοντας το ποσό που θα προκύψει.
   
"""

def anatokismos(p,r,n):
    K = p * ( (1 + r) ** n)
    return K


P = eval(input("Δώσε το ποσό: "))
R = eval(input("Δώσε το επιτόκιο: "))
N = eval(input("Δώσε τα χρόνια: "))
k = anatokismos(P,R,N)
print("Το ποσό που προκύπτει είναι",k,"€.")