# -*- coding: utf-8 -*-
"""
   File name: ex_9.26.py
   
   *------------------------------------------------------
   
   Να δημιουργηθεί λεξικό που θα περιέχει τον κωδικό ενός προϊόντος και την τιμή του. Να εισαχθούν επαναληπτικά πολλά 
   προϊόντα με τις τιμές τους, μέχρι να δοθεί ως τιμή αρνητικός αριθμός.
"""

l_proion = list()
l_timi = list()
proion = input("Δώσε τον κωδικό του προϊόντος: ")
timi = eval(input("Δώσε την τιμή του προϊόντος: "))
while(timi >= 0):
    l_proion.append(proion)
    l_timi.append(timi)
    proion = input("Δώσε τον κωδικό του προϊόντος: ")
    timi = eval(input("Δώσε την τιμή του προϊόντος: "))
d = dict(zip(l_proion,l_timi))
print(d)    