# -*- coding: utf-8 -*-
"""
   File name: ex_9.5.py
   
   *----------------------------------
   
   Να γράψετε πρόγραμμα που θα διαβάζει κείμενο και θα δημιουργεί λεξικό με κλειδιά κάθε ξεχωριστό γράμμα του κειμένου και 
   τις τιμές τους το πόσες φορές εμφανίζεται το κάθε γράμμα.
"""

ch_str = input("Γράψε ότι θες: ")
l_ch = list()
ch_freq = list()
for i in ch_str:
    l_ch.append(i)
    ch_freq.append(ch_str.count(i))
    d = dict(zip(l_ch,ch_freq))
print("{Γράμμα: Συχνότητα εμφάνισης}")
print(d)
