# -*- coding: utf-8 -*-
"""
   File name: ex_9.14.py
   
   *---------------------------------------------------
   
   Να γράψετε πρόγραμμα που θα διαγράφει διπλές τιμές ενός λεξικού ώστε στο τέλος κάθε τιμή να υπάρχει μόνο μία φορά.
   
   Η άσκηση 13 ουσιατικά περιλαμβάνεται στην άσκηση 14 και αυτή είναι η εκφώνησή της:
   Να γράψετε πρόγραμμα που θα ελέγχει αν υπάρχουν διπλότυπες τιμές σε ένα λεξικό.
"""

d = {'a': 1, 'b': 2, 'c': 3, 'd': 2, 'e': 5}
temp = []
res = dict()
 
for key, val in d.items():
   
    if val not in temp:
        temp.append(val)
        res[key] = val
print(res)        