# -*- coding: utf-8 -*-
"""
   File name: ex_9.7.py
   
   *----------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται ένα κλειδί από το πληκτρολόγιο, θα ελέγχει αν υπάρχει αυτό και, εφόσον υπάρχει, θα 
   αλλάζει το κλειδί κατάλληλα ώστε να μπορεί να τοποθετηθεί το καινούργιο.
"""

d = {'a': 1, 'b': 2, 'c': 3}
k = eval(input("Δώσε το key: "))
v = eval(input("Δώσε το value: "))
for key,val in d.items():
    if key == k:
     d[k] = d.get(k,0) + v - val
print(d)    