# -*- coding: utf-8 -*-
"""
   File name: ex_2.10.py
   
   *-------------------------------
   
   Να γράψετε πρόγραμμα που να δέχεται μια θερμοκρασία σε Κελσίου και θα τη μετατρέπει αναλόγως σύμφωνα με τους παρακάτω 
   τύπους μετατροπής:
       Fahrenheit,   F = C *(9/5) + 32
       Kelvin,       K = C + 273.15
       Rankive,      R = C + 273.15 *(9/5)
       Delisle,      De = (100 - C)* (3/2)
       Newton,       N = C - (33/100)
       Reamur,       Re = C * (4/5)
       Romer,        Ro = C * (21/40) + 7.5
"""

temp = float(input("Δώσε θερμοκρασία σε βαθμούς Κελσίου: "))
F = temp * (9 / 5) + 32
print("Οι",temp," βαθμοί Κελσίου αντιστοιχούν σε",F,"βαθμούς Fahrenheit.")
K = temp + 273.15
print("Οι",temp," βαθμοί Κελσίου αντιστοιχούν σε",K,"βαθμούς Kelvin.")
R = temp + 273.15 * (9 / 5)
print("Οι",temp," βαθμοί Κελσίου αντιστοιχούν σε",R,"βαθμούς Rankive.")
De = (100 - temp) * (3 / 2)
print("Οι",temp," βαθμοί Κελσίου αντιστοιχούν σε",De,"βαθμούς Delisle.")
N = temp - (33 / 100)
print("Οι",temp," βαθμοί Κελσίου αντιστοιχούν σε",N,"βαθμούς Newton.")
Re = temp * (4 / 5)
print("Οι",temp," βαθμοί Κελσίου αντιστοιχούν σε",Re,"βαθμούς Reamur.")
Ro = temp * (21 / 40) + 7.5
print("Οι",temp," βαθμοί Κελσίου αντιστοιχούν σε",Ro,"βαθμούς Romer.")

