# -*- coding: utf-8 -*-
"""
   File name: ex_2.2.py
   
   *--------------------------------
   
   Να γράψετε πρόγραμμα που θα ζητάει το κόστος ενός προϊόντος και τον αριθμό άτοκων δόσεων ενός καταστήματος, 
   υπολογίζοντας και εμφανίζοντας το ποσό κάθε δόσης. Τι θα αλλάξει αν υπάρχει επιβάρυνση με 7% επιτόκιο στο ποσό πληρωμής;
"""

x = float(input("Δώσε το κόστος του πρϊόντος: "))
k = int(input("Δώσε αριθμό δόσεων: "))
epitokio = 0                               # epitokio = 7 / 100    -> παρατηρούμε ότι αυξάνεται το πόσο της δόσης
dosi = (x + x * epitokio) / k                  
print("Η δόση αντιστοιχεί σε ",dosi,"€")

