# -*- coding: utf-8 -*-
"""
   File mame: ex_2.12.py
   
   *--------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται (χωρίς έλεγχο) έναν τριψήφιο αριθμό και θα τυπώνει το άθροισμα των ψηφίων του και τον
   αριθμό ανάποδα (με αντιστροφή των ψηφίων του).
"""

x = int(input("Δώσε έναν τριψήφιο αριθμό: "))
psifio_1 = x // 100
psifio_2 = (x % 100) // 10
psifio_3 = x % 10
athroisma = psifio_1 + psifio_2 + psifio_3
print("Το άθροισμα των ψηφίων του αριθμού",x,"είναι:",athroisma)
print("Ο αντίστροφος αριθμός του αριθμού",x,"είναι: ",psifio_3,psifio_2,psifio_1,sep="")
