# -*- coding: utf-8 -*-
"""
   File name: ex_2.14.py
   
   *------------------------------
   
   Αν δοθούν οι συντεταγμένες δύο σημείων στο επίπεδο, να γράψετε πρόγραμμα το οποίο θα υπολογίζει την ευκλείδεια απόστασή 
   τους:
       y=sqrt((x2 - x1) ** 2 + (y2 - y1) ** 2)
"""
import math

x1 = int(input("Δώσε την συντεταγμένη του χ ως προς τον οριζόντιο άξονα: "))
x2 = int(input("Δώσε την συντεταγμένη του χ ως προς τον κάθετο άξονα: "))
y1 = int(input("Δώσε την συντεταγμένη του y ως προς τον οριζόντιο άξονα: "))
y2 = int(input("Δώσε την συντεταγμένη του y ως προς τον κάθετο άξονα: "))
eyk_apo = math.sqrt((x2 - x1) ** 2 + (y2 - y1) ** 2)
print("Η ευκλείδεια απόσταση των δύο σημείων είναι",eyk_apo,"μονάδες.")