# -*- coding: utf-8 -*-
"""
   File name: ex_2.4.py
   
   *------------------------------------
   
   Ένας εργαζόμενος πληρώνεται κάθε εβδομάδα σύμφωνα με τις ώρες εργασίας του με ένα συγκεκριμένο ωρομίσθιο. Υπάρχουν 
   κρατήσεις 10% για ασφάλιση και 12% για φόρο. Δικαιούται επίδομα 20€ για κάθε παιδί που έχει. Να γράψετε πρόγραμμα που θα 
   ζητάει τις ώρες εργασίας, την αμοιβή ανά ώρα και τον αριθμό πσιδιών. Θα εμφανίζει τις κρατήσεις αναλυτικά, το επίδομα 
   παιδιών καθώς και το τελικό ποσό πληρωμής.
"""

x = int(input("Δώσε τις ώρες εργασίας: "))
y = float(input("Δώσε την αμοιβή ανά ώρα: "))
z = int(input("Δώσε αριθμό παιδιών: "))
katharos = x * y
kratisi_asfalisis = katharos * 10 / 100
kratisi_forou = katharos * 12 / 100
print("Η κράτηση για ασφάλιση αντιστοιχεί σε ",kratisi_asfalisis,"€")
print("Η κράτηση για φόρους αντιστοιχεί σε ",kratisi_forou,"€")
epidoma_paidiwn = z * 20
print("Το επίδομα παιδιών αντιστοιχεί σε ",epidoma_paidiwn,"€")
misthos = katharos - kratisi_asfalisis - kratisi_forou + epidoma_paidiwn
print("Ο τελικός μισθός αντιστοιχεί σε ",misthos,"€")

