# -*- coding: utf-8 -*-
"""
   File name: ex_2.8.py
   
   *-----------------------------
   
   Ένα φορτηγό πλοίο δέχεται φορτία σε κοντέινερ των 10,5,2 και 1 τόνων. Να γράψετε πρόγραμμα που θα ζητάει το συνολικό 
   βάρος του φορτίου που θα δεχθεί το πλοίο και θα εμφανίζει πόσα κοντέινερ κάθε τύπου θα χρειαστούν. Για παράδειγμα, εάν 
   το φορτίο είναι 38 τόνοι, θα χρειαστούν 3 κοντέινερ των 10,1 των 5,1 των 2 και 1 του ενός τόνου.
"""

x = int(input("Δώσε το συνολικό βάρος του φορτίου(σε τόνους): "))
print("Για φορτίο",x,"τόνων θα χρειαστούν",end=" ")
c_10 = x // 10
x -= c_10 * 10
c_05 = x // 5
x -= c_05 * 5
c_02 = x // 2
x -= c_02 * 2
print(c_10,"κοντέινερ των 10,",c_05,"των 5",c_02,"των 2 και",x,"του ενός τόνου.")

