# -*- coding: utf-8 
""" 
    File name: ex_2.1.py
    
    *------------------------------------------------
    
    Να γράψετε πρόγραμμα που θα ζητάει την τιμή πώλησης ενός προϊόντος κάποιου καταστήματος και το ποσοστό που έχει αυτό, 
    υπολογίζοντας (και εμφανίζοντας) το ποσό της έκπτωσης και το τελικό πληρωτέο ποσό. Το ποσοστό θα δίνεται ως ακέραιος 
    αριθμός.
""" 
x = float(input("Δώσε τιμή πώλησης προϊόντος: "))
y = int(input("Δώσε ποσοστό έκπτωσης: "))
ekptosi = x * y / 100
teliko_poso = x - ekptosi
print("Η έκπτωση αντιστοιχεί σε ",ekptosi,"€")
print("Το τελικό πληρωτέο ποσό αντιστοιχεί σε ",teliko_poso,"€")  
