# -*- coding: utf-8 -*-
"""
   File name: ex_2.13.py
   
   *--------------------------------------
   
   Η μελλοντική αξία ενός ποσού I που τοκίζεται με επιτόκιο ε ανά ν περιόδους τον χρόνο, για Τ χρόνια, υπολογίζεται από τον
   παρακάτω τύπο:
       FV = I * (1 + (ε / ν)) ** (ν * Τ)
   Να γράψετε πρόγραμμα που θα διαβάζει το ποσό, το επιτόκιο, τα έτη και τις περιόδους ανατοκισμού, εμφανίζοντας στο τέλος
   τη μελλοντική αξία του ποσού.
"""

poso = float(input("Δώσε το ποσό: "))
epitokio = int(input("Δώσε το επιτόκιο: "))
epitokio /= 100
eti = int(input("Δώσε τα έτη: "))
p_anatokismou = int(input("Δώσε τις περιόδους ανατοκισμού: "))
mellontiki_aksia = poso * (1 + (epitokio / p_anatokismou) ** (p_anatokismou * eti))
print("Η μελλοντική αξία του ποσού είναι: ",mellontiki_aksia,"€.")
