# -*- coding: utf-8 -*-
"""
   File name: ex_2.19.py
   
   *-----------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται τους συντελεστές α,β,γ μιας δευτεροβάθμιας εξίσωσης:
       y=αx**2+βx+γ
   και θα εμφανίζει τις δύο λύσεις της βάσει του τύπου:
       x1=(-β + sqrt(Δ))/2α    x2=(-β - sqrt(Δ))/2α    με Δ=β**2 - 4αγ με την υπόθεση ότι: Δ>0
"""
import math

a = int(input("Δώσε μια τιμή: "))
b = int(input("Δώσε μια τιμή: "))
c = int(input("Δώσε μια τιμή: "))
D = b ** 2 - 4*a*c
x1 = (-b + math.sqrt(D)) / (2 * a)
x2 = (-b - math.sqrt(D)) / (2 * a) 
print("Οι δύο λύσεις είναι x1=",x1,"και x2=",x2,".")