# -*- coding: utf-8 -*-
"""
   File name: ex_2.7.py
   
   *------------------------------
   
   Ένας αυτόματος πωλητής δέχεται και επιστρέφει μόνο κέρματα των 2,1,0.5,0.1€. Να γράψετε πρόγραμμα που θα δέχεται την τιμή
   ενός προϊόντος και το ποσό που πλήρωσε ο πελάτης, εμφανίζοντας τα ρέστα αναλυτικά ανά κέρμα.
"""

x = float(input("Δώσε την τιμή του προϊόντος: "))
z = float(input("Δώσε το ποσό που πλήρωσε ο πελάτης: "))
resta = z - x
kerma_02 = resta // 2
resta -= kerma_02 * 2 
kerma_01 = resta // 1
resta -= kerma_01
kerma_half_euro = resta // 0.5
resta -= kerma_half_euro * 0.5
kerma_one_tenth_euro = resta // 0.1
print("Τα ρέστα που θα πάρει ο πελάτης είναι",int(kerma_02),"κέρματα των 2€,",int(kerma_01),"κέρματα του 1€,",int(kerma_half_euro),"κέρματα των 0.5€ και",int(kerma_one_tenth_euro),"κέρματα των 0.1€.")