# -*- coding: utf-8 -*-
"""
   File name: ex_2.30.py
   
   *-------------------------------------(Τα αποτελέσματα των ρίψεων είναι προκαθορισμένα και συγκεκριμένα κατά σειρά: 1η κορόνα, 2η γράμματα, 3η κορόνα)
   
    Να γράψετε ένα πρόγραμμα που θα "ρίχνει" εικονικό νόμισμα 3 φορές, θεωρώντας ως 1 την κορόνα (head) και 0 τα γράμματα 
    (tail). Το πρόγραμμα θα μετρά και θα εμφανίζει πόσες φορές "έπεσε" κορόνα και πόσες γράμματα, υπολογίζοντας τα ποσοστά 
    τους.
"""
s_1 = 0
s_2 = 0
print("Ρίψη νομίσματος")
x = int(input("Για κορόνα γράψε '1' ή για γράμματα γράψε '2':"))
print("Η πρώτη ρίψη ήταν κορόνα(",x,").",sep="")
s_1 += 1
print("Ρίψη νομίσματος")
x = int(input("Για κορόνα γράψε '1' ή για γράμματα γράψε '2':"))
print("Η δεύτερη ρίψη ήταν γράμματα(",x,").",sep="")
s_2 += 1
print("Ρίψη νομίσματος")
x = int(input("Για κορόνα γράψε '1' ή για γράμματα γράψε '2':"))
print("Η τρίτη ρίψη ήταν κορόνα(",x,").",sep="")
s_1 += 1
print("Έπεσε",s_1,"φορές κορόνα και",s_2,"φορές γράμματα.")
korona = s_1 / 3
grammata = s_2 / 3
print("Κορόνα: %3.3f" %korona,"%.",sep="")
print("Γράμματα: %3.3f" %grammata,"%.",sep="") 