# -*- coding: utf-8 -*-
"""
   File name: ex_2.27.py
   
   *------------------------------
   
   Ο Ήρων ο Αλεξανδρινός περιέγραψε τον τύπο για το εμβαδό τριγώνου με πλευρές α,β,γ με βάση τον πιο κάτω τύπο:
       Α = sqrt(σ*(σ-α)*(σ-β)*(σ-γ))
   όπου σ = (α + β + γ) / 2  είναι η ημιπερίμετρος του τριγώνου. Να γράψετε πρόγραμμα που θα ζητάει το μήκος των τριών 
   πλευρών και θα εμφανίζει το εμβαδό του τριγώνου.  
"""
import math

a = int(input("Δώσε το μήκος μιας πλευράς: "))
b = int(input("Δώσε το μήκος μιας πλευράς: "))
c = int(input("Δώσε το μήκος μιας πλευράς: "))
s = (a + b + c) / 2
A = math.sqrt(s*(s-a)*(s-b)*(s-c))
print("Το εμβαδόν του τριγώνου ισούται με",A,".")

