# -*- coding: utf-8 -*-
"""
   File name: ex_6.6.py
   
   *-------------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται μια λέξη από το πληκτρολόγιο. Δίνεται επίσης κάποιο έτοιμο κείμενο. Να εμφανίζει το 
   πρόγραμμα ποιες λέξεις του κειμένου περιέχουν τη λέξη που δόθηκε.
"""

word = input("Δώσε μία λέξη: ")
text = 'Το υλικό αυτής της σελίδας προσφέρεται μόνο σε φοιτητές του τμήματος Εφαρμοσμένης Πληροφορικής - ΠΑΜΑΚ.'
x = text.split()
print("Η λέξη",word,"βρίσκεται στη/στις λέξη/λέξεις: ")
for i in range(len(x)): 
 if word in x[i] :
    print(x[i])
