# -*- coding: utf-8 -*-
"""
   File name: ex_6.18.py
   
   *----------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται έναν δεκαδικό αριθμό στο διάστημα (0, 1) και θα τον εμφανίζει ως ποσοστό με ακρίβεια
   2 δεκαδικών. Π.χ. αν δοθεί ο αριθμός 0.34568 να εμφανιστεί ως 34.57%.
"""

x = float(input("Δώσε δεκαδικό αριθμό στο διάστημα (0, 1): "))
while(x < 0 or x > 1):
    x = float(input("Δώσε ξανά δεκαδικό αριθμό στο διάστημα (0, 1): "))
print("%.2f" %(x * 100),"%")    