# -*- coding: utf-8 -*-
"""
   File name: ex_6.39.py
   
   *--------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται κείμενο με λέξεις και θα εμφανίζει κάθε λέξη αντίστροφα.
"""

s = '''Στο πρώτο φιλικό επί ελληνικού εδάφους εν όψει του Παγκοσμίου Κυπέλλου, η Εθνική ομάδα μπάσκετ υποδέχεται τη 
Σλοβενία του Λούκα Ντόντσιτς στις 4 Αυγούστου στο ΟΑΚΑ. Το κοινό πέρα από τα αστέρια των δύο ομάδων θα απολαύσει και την 
βράβευση του μεγάλου Νίκου Γκάλη.
'''
x = s[::-1]
print(x)


''' # Σε περίπτωση που θέλουμε το κείμενο έτσι όπως ήταν με την κάθε λέξη ανάποδα
word_split = s.split()
for i in range(len(word_split)):
    x = word_split[i]
    print(x[::-1],end = " ")
'''        