# -*- coding: utf-8 -*-
"""
   File name: ex_5.9.py
   
   *------------------------------------------------
   
   Να γράψετε πρόγραμμα που θα διαβάζει από το πληκτρολόγιο αριθμούς και θα τους αποθηκεύει σε μια λίστα. Αν δοθεί αρνητικός
   αριθμός, θα σταματάει η εισαγωγή. Στη συνέχεια θα υπολογίζει και θα τυπώνει:
       - Το πλήθος των αριθμών που δόθηκαν.
       - Τον μέσο όρο των αριθμών που δόθηκαν.
       - Το πόσοι αριθμοί της λίστας είναι μεγαλύτεροι του μέσου όρου και πόσοι μικρότεροι ή ίσοι.
"""

x = float(input("Δώσε θετικό αριθμό: "))
arithmoi = list()
while(x >= 0):
    arithmoi.append(x)
    x = float(input("Δώσε θετικό αριθμό: "))
print("Δόθηκαν",len(arithmoi),"αριθμοί.")
s = 0
for i in range(len(arithmoi)):
    s += arithmoi[i]    
mo = s / len(arithmoi)
print("Ο μέσος όρος των αριθμών είναι %.2f" %mo,".")
pano_apo = 0 
kato_apo = 0
for i in range(len(arithmoi)):
    if(arithmoi[i] > mo):
        pano_apo += 1
    else:
        kato_apo += 1
print(pano_apo,"αριθμοί είναι μεγαλύτεροι του μέσου όρου.")
print(kato_apo,"αριθμοί είναι μικρότεροι ή ίσοι του μέσου όρου.")        