# -*- coding: utf-8 -*-
"""
   File name: ex_5.13.py
   
   *-----------------------------------------
   
   Μια εταιρεία catering απασχολεί 15 άτομα. Να γράψετε πρόγραμμα το οποίο:
       (α) Διαβάζει τα ονοματεπώνυμα των υπαλλήλων και τα αποθηκεύει σε μια λίστα.
       (β) Διαβάζει τον μηνιαίο μισθό κάθε υπαλλήλου (500 <= μισθός <= 2000) και τους τοποθετεί σε μια λίστα.
       (γ) Υπολογίζει και τυπώνει τον μέσο μηνιαίο μισθό.
       (δ) Υπολογίζει και τυπώνει τα ονόματα και το πλήθος των υπαλλήλων που αμείβονται με μηνιαίο μισθό μεγαλύτερο του 
           μέσου όρου.
"""

onomata = list()
misthoi = list()

# Ζητούμενο (α) και (β)
for i in range(15):
    name = input("Δώσε ονοματεπώνυμο υπαλλήλου: ")
    onomata.append(name)
    misthos = float(input("Δώσε τον μηνιαίο μισθό του υπαλλήλου: "))
    while(misthos < 500 or misthos > 2000):
        misthos = float(input("Δώσε  ξανά τον μηνιαίο μισθό του υπαλλήλου: "))
    misthoi.append(misthos)
# Ζητούμενο (γ)
s = 0
for i in range(15):
  s += misthoi[i]      
mo = s / 15
print("Ο μέσος μηνιαίος μισθός είναι %.2f" %mo,"€.",sep = "")
# Ζητούμενο (δ)
print("Οι υπάλληλοι με μηνιαίο μισθό μεγαλύτερο του μέσου όρου είναι: ")
pano = 0
for i in range(15):
    if(misthoi[i] > mo):
        pano += 1
        print(onomata[i])
print("Επομένως",pano,"υπάλληλοι.")        