# -*- coding: utf-8 -*-
"""
   File name: ex_5.14.py
   
   *----------------------------------
   
   Στις τελευταίες δημοτικές εκλογές για τον δήμο «Θήτα», συμμετείχαν τέσσερις υποψήφιοι δήμαρχοι. Τα έγκυρα ψηφοδέλτια 
   ήταν 10000. Τα αποτελέσματα των εκλογών καταγράφονται παρακάτω:
       
       ΟΝΟΜΑ ΣΥΝΔΥΑΣΜΟΥ                ΨΗΦΟΙ
       Για έναν καλύτερο δήμο          3582
       Μπορούμε και καλύτερα           2727
       Για μια νέα πόλη                683
       Νέα Εποχή - Νέα Πόλη            3008
       
   Να γράψετε κώδικα ο οποίος θα αποθηκεύει τον πίνακα σε μια λίστα με τα ονόματα και σε μια δεύτερη με τις αντίστοιχες 
   ψήφους. Οι ψήφοι κάθε συνδυασμού πρέπει να εισάγονται από το πληκτρολόγιο (0 <= ψήφοι συνδυασμού <= 10000). Επίσης, να
   πραγματοποιείται έλεγχος αν το άθροισμα των ψήφων όλων των συνδυασμών είναι >10000. Αν είναι, να ζητάει την εισαγωγή εκ
   νέου των ψήφων για κ΄άθε συνδυασμό. Στη συνέχεια, να υπολογίζει και να τυπώνει το ποσοστό που έλαβε κάθε συνδυασμός, 
   εμφανίζοντας την τελική κατάταξή τους σε φθίνουσα σειρά με βάση τις ψήφους.     
"""

onomata = ['Για έναν καλύτερο δήμο', 'Μπορούμε και καλύτερα', 'Για μια νέα πόλη', 'Νέα Εποχή - Νέα Πόλη']
psifoi = list()
s = 0
for i in range(4):
    psi = int(input("Δώσε τις ψήφους του συνδυασμού: "))
    if(psi < 0 or psi > 10000):
        psi = int(input("Δώσε ξανά τις ψήφους του συνδυασμού: "))
    s += psi
    psifoi.append(psi)
while(s > 10000):
    print("Πρέπει να ξαναδώσεις τις ψήφους του κάθε συνδυασμού.")
    for i in range(4):
        psi = int(input("Δώσε τις ψήφους του συνδυασμού: "))
        if(psi < 0 or psi > 10000):
            psi = int(input("Δώσε ξανά τις ψήφους του συνδυασμού: "))
        s += psi
        psifoi.append(psi)
index = list(range(len(psifoi)))
index.sort(key = psifoi.__getitem__, reverse = True)
psifoi[:] = [psifoi[i] for i in index]
onomata[:] = [onomata[i] for i in index]
for i in range(4):
    print(onomata[i],": %.2f" %((psifoi[i] / 10000) * 100), "%.")
