# -*- coding: utf-8 -*-
"""
   File name: ex_8.2.py
   
   *----------------------------------------
   
   Να γράψετε πρόγραμμα που θα δημιουργεί νέο σύνολο από άλλο αντικείμενο (λίστα ή συμβολοσειρά).
"""

x = input("Λίστα ή συμβολοσειρά ; ")
if(x == "Λίστα"):
    l = list()
    stoixeio = eval(input("Δώσε στοιχείο για εισαγωγή στη λίστα (για τερματισμό εισαγωγής στοιχείων: ' '): "))
    while stoixeio != ' ':
     l.append(stoixeio)
     stoixeio = eval(input("Δώσε στοιχείο για εισαγωγή στη λίστα (για τερματισμό εισαγωγής στοιχείων: ' '): "))
    s = set(l)
else:
   text = input("Δώσε μια συμβολοσειρά: ")
   s = set(text)
print("s:",s)    