# -*- coding: utf-8 -*-
"""
   File name: ex_8.5.py
   
   *----------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται 100 αριθμούς, από το 1 μέχρι το 10, και θα τους εισάγει σε ένα σύνολο. Να 
   κατασκευάσετε κατάλληλη δομή όπου θα καταγράφεται το πλήθος εμφάνισης κάθε αριθμού. Τι είδους δομή θα επιλέγατε;
   (Εγώ επίλεξα λίστα)
"""

l = list()
for i in range(100):
    x = eval(input("Δώσε αριθμό από το 1 μέχρι το 10: "))
    l.append(x)
s = set(l)
print("Σύνολο:",s)
for i in s:
 c = l.count(i)
 print("Ο αριθμός",i,"εμφανίστηκε",c,"φορές.")    