# -*- coding: utf-8 -*-
""" 
   File name: ex_8.8.py
   
   *--------------------------------------
   
   Μια βιβλιοθήκη διαθέτει δύο καταλόγους με τίτλους βιβλίων. Να γράψετε πρόγραμμα που θα εμφανίζει α) τους κοινούς τίτλους,
   β) τους τίτλους που υπάρχουν μόνο σε έναν από τους καταλόγους και γ) όλους τους διαφορετικούς τίτλους βιβλίων.
"""

kat_01 = {'A','B','C','D'}
kat_02 = {'C','D','E','F'}
# Ζητούμενο α)
koinoi = kat_01.intersection(kat_02)
print("Κοινοί τίτλοι:",koinoi)
# Ζητούμενο β)
se_enan_01 = kat_01 - kat_02
se_enan_02 = kat_02 - kat_01
print("Τίτλοι που υπάρχουν μόνο σε έναν από τους καταλόγους:")
print("Κατάλογος 1:",se_enan_01)
print("Κατάλογος 2:",se_enan_02)
# Ζητούμενο γ) 
oloi = kat_01.union(kat_02)
print("Όλοι οι διαφορετικοί τίτλοι βιβλίων:",oloi)