# -*- coding: utf-8 -*-
"""
   File name: ex_8.1.py
   
   *--------------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται στοιχεία από τον χρήστη μέχρι να δοθεί το κενό και θα δημιουργεί δύο νέα σύνολα. Το 
   ένα με χρήση συνάρτησης.
"""

s_01 = set()
s_02 = set()
x = eval(input("Δώσε στοιχείο (για να σταματήσει η εισαγωγή στοιχείων δώσε: ' '): "))
while x != " ":
    s_01.add(x)
    s_02 |= {x}
    x = eval(input("Δώσε στοιχείο (για να σταματήσει η εισαγωγή στοιχείων δώσε: ' '):  "))
print("Με την χρήση συνάρτησης:",s_01)
print("Χωρίς την χρήση συνάρτησης:",s_02)    