# -*- coding: utf-8 -*-
"""
   File name: ex_4.18.py
   
   *----------------------------
   
   Να γράψετε πρόγραμμα που θα υπολογίζει τον αρμονικό μέσο για σύνολο n θετικών αριθμών οι οποίοι δίνονται από τον χρήστη.
   Ο αρμονικός μέσος υπολογίζεται από τον τύπο:
       
                               H = (n / ((1 / x1) + (1 / x2) + ... + (1 / xn)))
"""

syn = 0
n = int(input("Δώσε τον αριθμό των n θετικών αριθμών: "))
for i in range(1,n+1):
    x = int(input("Δώσε θετικό αριθμό: "))
    syn += (1 / x) 
H = n / syn
print("Ο αρμονικός μέσος είναι",H)