# -*- coding: utf-8 -*-
"""
   File name: ex_4.8.py
   
   *-------------------------------
   
   Στα προκριματικά αγώνων στίβου στο άθλημα του άλματος επί κοντώ, συμμετέχουν 22 αθλητές. Έχουν έξι προσπάθειες να 
   ξεπεράσουν το όριο των 5.3 μέτρων. Αν κάποιος το ξεπεράσει, δεν συνεχίζει με άλλη προσπάθεια, ενώ εμφανίζεται το 
   ονοματεπώνυμό του με τη λέξη "προκρίνεται", η επίδοση πρόκρισης και ο αριθμός προσπαθειών που έκανε μέχρι να το πετύχει.
   Αν καμία από τις προσπάθειες δεν είναι επιτυχής, τότε εμφανίζεται δίπλα στο ονοματεπώνυμο του αθλητή η φράση 
   "Δεν προκρίνεται". Να εμφανιστεί πόσοι έχουν προκριθεί και πόσοι το πέτυχαν με τις λιγότερες προσπάθειες.
"""

prokrithikan = 0
ligoteres = 0

for i in range(22):
    prospatheia = 0
    onomatepwnymo = input("Δώσε το ονοματεπώνυμο του αθλητή: ")
    while(prospatheia < 6):
         prospatheia +=1
         voli = float(input("Δώσε την επίδοση της προσπάθειας: "))
         if(voli >= 5.3):
             if(prospatheia < 3):
                 ligoteres += 1
             prokrithikan += 1    
             break
    print(onomatepwnymo,"προκρίνεται,",voli,"μέτρα,",prospatheia,"προσπάθειες")     
print("Έχουν προκριθεί",prokrithikan,"αθλητές.")
print(ligoteres,"αθλητές το πέτυχαν με τις λιγότερες προσπάθειες.")    