# -*- coding: utf-8 -*-
"""
   File name: ex_4.33.py
   
   *------------------------------------------
   
   Να γράψετε πρόγραμμα που να διαβάζει τους βαθμούς 20 μαθητών και τους αντίστοιχους βαθμούς τους (σε κλίμακα 1-20) στο
   μάθημα της πληροφορικής. Στη συνέχεια να υπολογίζει και να εμφανίζει στην οθόνη:
       (α) Το πλήθος και το ποσοστό των μαθητών που έχουν βαθμό >= 17.
       (β) Τον μέσο όρο των βαθμών όλων των μαθητών.
       (γ) Το πλήθος και το ποσοστό των μαθητών που έχουν βαθμό < 10.
"""
synolo = 0
pano_apo_17 = 0
kato_apo_10 = 0

for i in range(20):
    vathmos = float(input("Δώσε τον βαθμό του μαθητή στο μάθημα της πληροφορικής: "))
    synolo += vathmos
    if(vathmos >= 17):
        pano_apo_17 += 1
    if(vathmos < 10):
        kato_apo_10 += 1
# Ζητούμενο (α)
pos_17 = (pano_apo_17 / 20) * 100
print(pano_apo_17,"μαθητές έχουν πάνω από 17. Δηλαδή το",pos_17,"% του συνόλου των μαθητών.")        
# Ζητούμενο (β)
mo = synolo / 20
print("Ο μέσος όρος των βαθμών όλων των μαθητών είναι",mo,".")
# Ζητούμενο (γ)
pos_10 = (kato_apo_10 / 20) * 100
print(kato_apo_10,"μαθητές έχουν κάτω από 10. Δηλαδή το",pos_10,"% του συνόλου των μαθητών.")        