# -*- coding: utf-8 -*-
"""
   File name: ex_4.17.py
   
   *------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται από τον χρήστη n θετικούς αριθμούς, υπολογίζοντας τον αριθμητικό μέσο και την τυπική
   απόκλιση βάσει των τύπων:
                           x = (1 / n)* Σ(i=1,n)xi
                    s = sqrt((n*Σ(i=1,n)xi² - (Σ(i=1,n)xi)²) / n(n - 1))
"""

import math

mo = 0
s = 0
syn_01 = 0 # Σ(i=1,n)xi
syn_02 = 0 # Σ(i=1,n)xi²
n = int(input("Δώσε τον αριθμό των n θετικών αριθμών: "))
for i in range(1,n+1):
    x = int(input("Δώσε ακέραιο αριθμό: "))
    syn_01 += x
    syn_02 += x ** 2
mo = (1 / n) * syn_01
s = math.sqrt( ((n * syn_02) - syn_01 ** 2) / n * (n - 1))
print("Ο αριθμητικός μέσος είναι",mo)
print("Η τυπική απόκλιση είναι",s)   
