# -*- coding: utf-8 -*-
"""
   File name: ex_4.11.py
   
   *--------------------------------
   
   Ένας επενδυτής μελετάει μια επένδυση που θα απαιτήσει αρχικό κόστος 100,000€ και θα του αποφέρει ανά έτος για 5 έτη 
   15,000€, αυξημένα κατά 5,000€ κάθε χρόνο. Για να προχωρήσει με τη συγκεκριμένη πρόταση, θα πρέπει να βρει την καθαρή 
   τρέχουσα αξία της, η οποία υπολογίζεται με τον πιο κάτω τύπο:
       
            NPV = Σ(i=1,T) Ct / (1 + r) ** t - C0
            
   όπου:
   Ct: η ταμειακή ροή της περιόδου t. Θετικές τιμές δηλώνουν εισροές (έσοδα), ενώ αρνητικές τιμές αντιστοιχούν σε εκροές 
   (έξοδα).
   r: το επιτόκιο δανεισμού (ή προεξοφλητικό επιτόκιο - discounted rate), έστω r = 5%.
   C0: το αρχικό κόστος της επένδυσης
   Σ(i=1,T): είναι το άθροισμα (ανάποδο)Atανήκει{1,2,...,Τ}
   t: μια συγκεκριμένη χρονική περίοδος από το σύνολο των περιόδων Τ.

   Η πρόταση θεωρείται ελκυστική αν έχει NPV > 0. Αφού γίνει ο υπολογισμός, να εμφανιστεί η καθαρή τρέχουσα αξία και
   αντίστοιχο μήνυμα σχετικό με το αν η συγκεκριμένη επενδυτική πρόταση θα πρέπει να υλοποιηθεί ή όχι.
   ΠΑΡΑΛΛΑΓΗ: τροποποιήστε τον κώδικά σας, ώστε να μπορεί να εφαρμοστεί για κάθε είδους επένδυση.         
"""

r = 0.05
C0 = 100000
T = 5
C = 15000

for i in range(1,T+1): 
    NPV = C / (1 + r) ** i
    C += 5000
NPV = NPV - C0
print("Η καθαρή τρέχουσα αξία είναι",NPV,"€.")
if(NPV > 0):
    print("Η συγκεκριμένη επενδυτική πρόταση θα πρέπει να υλοποιηθεί.")
else:
    print("Η συγκεκριμένη επενδυτική πρόταση δεν πρέπει να υλοποιηθεί.")    

"""                          
                                    ΠΑΡΑΛΛΑΓΗ
                                    
r = float(input("Δώσε το επιτόκιο δανεισμού (σε δεκαδικά): "))
C0 = int(input("Δώσε το αρχικό κόστος της επένδυσης: "))
T = int(input("Δώσε τα έτη που θα αποφέρουν έσοδα: "))
C = 0

for i in range(T):
   x = int(input("Δώσε την ταμειακή ροή του έτους: ))
   C += x
   NPV = C / (1 + r) ** i              
NPV = NPV - C0
print("Η καθαρή τρέχουσα αξία είναι",NPV,"€.")
if(NPV > 0):
    print("Η συγκεκριμένη επενδυτική πρόταση θα πρέπει να υλοποιηθεί.")
else:
    print("Η συγκεκριμένη επενδυτική πρόταση δεν πρέπει να υλοποιηθεί."


"""                                    