# -*- coding: utf-8 -*-
"""
   File name: ex_4.24.py
   
   *---------------------------------
   
   Ο υπολογισμός του ετήσιου φόρου 15 μισθωτών υπαλλήλων γίνεται με βάση το ετήσιο ακαθάριστο εισόδημά τους, ως εξής:
       Φόρος 10% για εισόδημα μέχρι και 12,000€
       Φόρος 24% για τα επόμενα 18,000€
       Φόρος 32% για τα επόμενα 25,000€
       Φόρος 45% για το υπόλοιπο εισόδημα
   Να γράψετε πρόγραμμα που θα:
   i.   Διαβάζει από το πληκτρολόγιο τις ετήσιες απολαβές κάθε υπαλλήλου.Να γίνεται έλεγχος ώστε να δίνονται θετικές τιμές.
   ii.  Υπολογίζει και εκτυπώνει στην οθόνη τον ετήσιο φόρο που αναλογεί σε κάθε υπάλληλο, καθώς και τον συνολικό φόρο.
   iii. Εκτυπώνει το μικρότερο ετήσιο εισόδημα και τον αντίστοιχο φόρο.
   iv.  Εκτυπώνει το μεγαλύτερο ετήσιο εισόδημα και τον αντίστοιχο φόρο.
"""

megaliteros = -1
mikroteros = 1000 ** 2346
meg_foros = 0
mik_foros = 0
foros = 0
for i in range(15):
    # Ζητούμενο i.
    apolaves = int(input("Δώσε τις ετήσιες απολαβές: "))
    while(apolaves < 0):
        print("Λάθος εισαγωγή εισοδήματος.")
        apolaves = int(input("Δώσε τις ετήσιες απολαβές: "))
    # Ζητούμενο ii.    
    if(apolaves <= 12000):
        foros = (10 / 100) * apolaves
    elif(apolaves <= 20000):
        foros = 12000 * (10 / 100) + (apolaves - 12000) * (24 / 100)
    elif(apolaves <= 45000):
        foros = 12000 * (10 / 100) + 18000 * (24 / 100) + (apolaves - 20000) * (32 / 100)
    else:
        foros = 12000 * (10 / 100) + 18000 * (24 / 100) + 25000 * (32 / 100) + (apolaves - 45000) * (45 / 100)
    if(apolaves > megaliteros):
        megaliteros = apolaves
        meg_foros = foros
    if(apolaves < mikroteros):
        mikroteros = apolaves
        mik_foros = foros
    print("Ο υπάλληλος έχει ετήσιο ακαθάριστο εισόδημα ",apolaves,"€ και συνολικό φόρο ",foros,"€.",sep = "")
# Ζητούμενο iii.
print("Το μικρότερο ετήσιο εισόδημα είναι ",mikroteros,"€ με φόρο ",foros,"€.",sep = "")
# Ζητούμενο iv.
print("Το μεγαλύτερο ετήσιο εισόδημα είναι ",megaliteros,"€ με φόρο ",foros,"€.", sep = "")    
        