# -*- coding: utf-8 -*-
"""
   File name: ex_4.28.py
   
   *---------------------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται ως είσοδο ένα διάστημα ετών, π.χ. [2000-2019], και θα τυπώνει όλα τα δίσεκτα έτη που
   περιλαμβάνονται σε αυτό. Ένα έτος είναι δίσεκτο αν διαιρείται ακριβώς με το 4. Αν όμως διαιρείται και με το 100, δεν 
   είναι δίσεκτο, εκτός αν διαιρείται ακριβώς με το 400.
"""


etos_arxi = int(input("Δώσε το έτος αρχή του διαστήματος[α,β]: "))
etos_telos = int(input("Δώσε το έτος τέλος του διαστήματος[α,β]: "))
for i in range(etos_arxi,etos_telos + 1):
    if((i % 4 == 0 and i % 100 != 0) or i % 400 == 0):
        print("Το",i,"είναι δίσεκτο.")
