# -*- coding: utf-8 -*-
"""
   File name: ex_3.1.py
   
   *-----------------------------------
   
   Σε έναν διαγωνισμό η βαθμολόγηση του υποψηφίου γίνεται σε τρία μαθήματα, με βαθμούς από 0 έως 100. Κάθε υποψήφιος 
   θεωρείται επιτυχών αν έχει συγκεντρώσει βαθμολογία σε κάθε μάθημα από 50 και πάνω ή αν ο μέσος όρος του είναι πάνω από 
   75. Να γράψετε πρόγραμμα που θα δέχεται τους τρεις βαθμούς και θα εμφανίζει μήνυμα αν ο υποψήφιος πέτυχε ή όχι.
"""

prwto_m = float(input("Δώσε την βαθμολογία του πρώτου μαθήματος: "))
deytero_m = float(input("Δώσε την βαθμολογία του δεύτερου μαθήματος: "))
trito_m = float(input("Δώσε την βαθμολογία του τρίτου μαθήματος: "))
mo = (prwto_m + deytero_m + trito_m) / 3
if((prwto_m >= 50.0 and deytero_m >= 50.0 and trito_m >= 50.0) or mo >= 75.0):
    print("Ο υποψήφιος πέτυχε.")
else:
    print("Ο υποψήφιος απέτυχε.")    
 