# -*- coding: utf-8 -*-
"""
   File name: ex_3.16.py
   
   *----------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται τον αριθμό ενός μήνα και θα εμφανίζει την εποχή.
"""

x = int(input("Δώσε τον αριθμό του μήνα: "))
if(x == 12 or x == 1 or x == 2):
    print("Χειμώνας.")
elif(x == 3 or x == 4 or x == 5):
    print("Άνοιξη.")
elif(x == 6 or x == 7 or x == 8):
    print("Καλοκαίρι.")
elif(x == 9 or x == 10 or x == 11):
    print("Φθινόπωρο.")    
else:
    print("Λάθος εισαγωγή αριθμού.")