# -*- coding: utf-8 -*-
"""
   File name: ex_3.18.py
   
   *------------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται ένα έτος και θα εμφανίζει αν είναι δίσεκτο ή όχι. Για να είναι ένα έτος δίσεκτο, θα
   πρέπει να διαίρειται ακριβώς με το 4 και όχι με το 100, εκτός και αν διαιρείται με το 400.
"""

etos = int(input("Δώσε ένα έτος: "))
if((etos % 4 == 0 and etos % 100 != 0) or etos % 400 == 0):
    print("Το",etos,"είναι δίσεκτο.")
else:
    print("Το",etos,"δεν είναι δίσεκτο.")    
