# -*- coding: utf-8 -*-
"""
   File name: ex_3.14.py
   
   *------------------------------
   
   Ένας μαθητής περνάει ένα μάθημα αν έχει σε αυτό άθροισμα τριών βαθμών (δύο προφορικοί και ένας γραπτός) πάνω από 27 ή αν
   έχει γενικό μέσο όρο μεγαλύτερο από 13. Διαφορετικά, θεωρείται μετεξεταστέος. Να γράψετε πρόγραμμα που θα δέχεται τους
   τρεις βαθμούς και τον γενικό μέσο όρο του, εμφανίζοντας κατάλληλο μήνυμα. 
"""

prof_01 = float(input("Δώσε τον πρώτο προφορικό βαθμό: "))
prof_02 = float(input("Δώσε τον δεύτερο προφορικό βαθμό: "))
graptos = float(input("Δώσε τον βαθμό του γραπτού: "))
mo = float(input("Δώσε τον γενικό μέσο όρο: "))
athroisma = prof_01 + prof_02 + graptos
if(athroisma >= 27 or mo >= 13):
    print("Ο μαθήτης περνάει το μάθημα.")
else:
    print("Ο μαθητής δεν περνάει το μάθημα, θεωρείται μετεξεταστέος.")    
