# -*- coding: utf-8 -*-
"""
   File name: ex_3.30.py
   
   *-----------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται έναν τυχαίο αριθμό από το 0 μέχρι το 36 ως αποτέλεσμα του παιχνιδιού της ρουλέτας 
   και θα εμφανίζει το χρώμα του ως εξής:
       -Πράσινο αν είναι 0
       -Κόκκινο αν είναι μονός αριθμός στα διαστήματα 1-10 και 19-28 και ζυγός στα διαστήματα 11-18 και 29-36 και
       -Μαύρο αν είναι ζυγός στα διαστήματα 1-10 και 19-28 και μονός στα διαστήματα 11-18 και 29-36.
"""

import random

x = random.randint(0, 36)
print(x)
if(x == 0):
    print("Πράσινο.")
elif((x % 2) == 1 and x <= 10): 
    print("Κόκκινο.")
elif((x % 2) == 1 and x >= 19 and x <= 28):
    print("Κόκκινο.")  
elif((x % 2) == 0 and x >= 11 and x <= 18):
    print("Κόκκινο.")
elif((x % 2) == 0 and x >= 29 and x <= 36):
    print("Κόκκινο.")    
else:
    print("Μαύρο.")    
    
# if(((x % 1) == 0 and x > 0 and x <= 10 and x >= 19 and x <= 28) ((x % 1) == 0 and x >= 11 and x <= 18 amd x >= 29 and x <= 36))    