# -*- coding: utf-8 -*-
"""
   File name: ex_3.3.py
   
   *--------------------------------
   
   Ένα πάρκινγκ χρεώνει τους πελάτες του για τις πρώτες 2 ώρες 5€ και για κάθε επόμενη ώρα 1.5€ επιπλέον. Να γράψετε
   πρόγραμμα που θα δέχεται τον χρόνο παραμονής του οχήματος και θα εμφανίζει το ποσό που πρέπει να πληρωθεί. 
"""

import math

wres = float(input("Δώσε (σε ώρες) τον χρόνο παραμονής του οχήματος: "))
poso = 0
x = 0
if(wres <= 2):
    poso = 5
else:
    x = (wres - 2) % 1
    if(x == 0):
        poso = 5 + (wres - 2) * 1.5
    else:
        poso = 5 + math.ceil(wres - 2) * 1.5
print("Ο πελάτης θα πληρώσει",poso,"€.")        
