# -*- coding: utf-8 -*-
"""
   File name: ex_3.2.py
   
   *--------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται έναν αριθμό και θα εμφανίζει αν είναι θετικός, αρνητικός ή μηδέν, καθώς και ακέραιος
   ή πραγματικός.
"""

x = eval(input("Δώσε έναν αριθμό: "))
if(x > 0):
    if(x % 1 == 0):
        print("Ο αριθμός είναι θετικός και ακέραιος.")
    else:
        print("Ο αριθμός είναι Θετικός και πραγματικός.")
elif(x < 0):
    if(x % 1 == 0):
        print("Ο αριθμός είναι αρνητικός και ακέραιος.")
    else:
        print("Ο αριθμός είναι αρνητικός και πραγματικός.")
else:
    print("Ο αριθμός είναι ο μηδέν.")
        