# -*- coding: utf-8 -*-
"""
   File name: ex_3.4.py
   
   *------------------------------
   
   Να γράψετε πρόγραμμα που θα δέχεται τους συντελεστές μιας δευτεροβάθμιας εξίσωσης και θα εμφανίζει τις λύσεις (αν υπάρχουν).
"""
import math

a = int(input("Δώσε μια τιμή: "))
b = int(input("Δώσε μια τιμή: "))
c = int(input("Δώσε μια τιμή: "))
D = b ** 2 - 4*a*c
if(D > 0):
    x1 = (-b + math.sqrt(D)) / (2 * a)
    x2 = (-b - math.sqrt(D)) / (2 * a) 
    print("Οι λύσεις της εξίσωσης είναι x1=",x1,"και x2=",x2,".")
elif(D == 0):
    x = -b / (2 * a)
    print("Η εξίσωση έχει μία μόνο λύση και αυτή είναι x=",x,".")
else:
    print("Η εξίσωση δεν έχει λύση/λύσεις.")    