# -*- coding: utf-8 -*-
"""
   File name: ex_3.5.py
   
   *-------------------------------------------
   
   Μια εταιρεία κινητής τηλεφωνίας χρεώνει τους συνδρομητές της σύμφωνα με τα παρακάτω στοιχεία:
      
       ΧΡΟΝΟΣ  ΟΜΙΛΙΑΣ        ΧΡΕΩΣΗ/ΛΕΠΤΟ          SMS         ΧΡΕΩΣΗ
            ΛΕΠΤΑ
            0-60                  0.03             0-100          5
            61-120                0.025            101-200        10
            121-...               0.018            201-...        15
   Πάγιο:5€ - ΦΠΑ: 24% επιπλέον
   Οι πιο πάνω χρεώσεις επιβαρύνονται με 24% ΦΠΑ. Να γράψετε πρόγραμμα που θα δέχεται τα λεπτά ομιλίας και το πλήθος των 
   μηνυμάτων ενός πελάτη, εμφανίζοντας το ποσό που πρέπει ο πελάτης να πληρώσει.       
"""
fpa = 24 / 100
lepta = int(input("Δώσε τα λεπτά ομιλίας του πελάτη: "))
sms = int(input("Δώσε το πλήθος των μηνυμάτων του πελάτη: "))
xreosi = 5
if(lepta <= 60):
    xreosi = xreosi + lepta * 0.03 * fpa + lepta * 0.03
elif(lepta >= 61 and lepta <= 120):
    xreosi = xreosi + lepta * 0.025 * fpa + lepta * 0.025
else:
    xreosi = xreosi + lepta * 0.018 * fpa + lepta * 0.018
if(sms <= 100):
    xreosi = xreosi + 5 + 5 * fpa
elif(sms > 100 and sms <= 200):
    xreosi = xreosi + 10 + 10 * fpa
else:
    xreosi = xreosi + 15 + 15 * fpa 
print("Ο πελάτης πρέπει να πληρώσει %.2f" %xreosi,"€")    
