# -*- coding: utf-8 -*-
"""
   File name: ex_3.28.py
   
   *--------------------------------
   
   Στο τυχερό παιχνίδι ζαριών ("κόκκαλα"), ο παίκτης κερδίζει αν φέρει 7 ή 11, χάνει αν φέρει 2,3 ή 12 και παίρνει πόντο με
   4,5,6,8,9 ή 10. Να γράψετε πρόγραμμα που θα δέχεται την τιμή κάθε ζαριού και θα εμφανίζει αντίστοιχο μήνυμα.
"""

zari = int(input("Δώσε την τιμή του ζαριού: "))
if(zari == 7 or zari == 11):
    print("Ο παίκτης κερδίζει.")
elif(zari == 2 or zari == 3 or zari == 12):
    print("Ο παίκτης χάνει.")
elif(zari == 4 or zari == 5 or zari == 6 or zari == 8 or zari == 9 or zari == 10):
    print("Ο παίκτης παίρνει πόντο.")
else:
    print("Λάθος εισαγωγή τιμής ζαριού.")    
