# -*- coding: utf-8 -*-
"""
   File name: ex_3.17.py
   
   *---------------------------------
   
   Στις επόμενες εκλογές ένας πολίτης υποχρεούται να ψηφίσει αν είναι από 17 ετών και πάνω, ενώ αν είναι πάνω από 75 δεν 
   είναι υποχρεωτικό να ψηφίσει. Να γράψετε ένα πρόγραμμα που θα δέχεται την ηλικία ενός ψηφοφόρου και θα εμφανίζει το 
   κατάλληλο μήνυμα για το αν μπορεί ή αν πρέπει να ψηφίσει ή αν δεν είναι υποχρεωτικό κάτι τέτοιο.
"""

ilikia = int(input("Δώσε την ηλικία του ψηφοφόρου: "))
if(ilikia < 17):
    print("Δεν μπορεί να ψηφίσει.")
elif(ilikia >= 17 and ilikia < 75):
    print("Πρέπει να ψηφίσει.")
else:
    print("Δεν είναι υποχρεωτικό να ψηφίσει.")    
