# -*- coding: utf-8 -*-
"""
   File name: ex_6.32.py
   
   *--------------------------------------------
   
   Δίνεται κείμενο που περιέχει γράμματα και αριθμούς. Να εμφανίσετε το πλήθος των γραμμάτων και των αριθμών. 
"""

txt = '''Στο πρώτο φιλικό επί ελληνικού εδάφους εν όψει του Παγκοσμίου Κυπέλλου, η Εθνική ομάδα μπάσκετ υποδέχεται τη 
Σλοβενία του Λούκα Ντόντσιτς στις 4 Αυγούστου στο ΟΑΚΑ. Το κοινό πέρα από τα αστέρια των δύο ομάδων θα απολαύσει και την 
βράβευση του μεγάλου Νίκου Γκάλη.
'''
grammata = 0
arithmoi = 0
for i in range(len(txt)):
    if(txt[i].isalpha()):
        grammata += 1
    if(txt[i].isnumeric()):
        arithmoi += 1
print("Γράμματα: ",grammata)
print("Αριθμοί: ",arithmoi)