# -*- coding: utf-8 -*-
"""
   File name: ex_6.2.py
   
   *----------------------------------------
   
   Δίνεται κείμενο μιας γραμμής. Να ελεγχθεί αν το κείμενο αυτό αποτελεί παλίνδρομο ή όχι. Ένα κείμενο θεωρείται παλίνδρομο 
   ή καρκινική γραφή όταν μπορεί να διαβαστεί και ανάποδα. Για παράδειγμα, η πρόταση «ΑΝΑΣΑΝΑ ΞΑΝΑΣΑΝΑ» είναι καρκινική
   γιατί διαβάζεται και ανάποδα.
"""

s_01 = input("Γράψε ότι θες: ")
s = s_01.replace(" ", "")
print(s)
for i in range(len(s)):    
    if(not(s[i].isalpha())):
        d = s.maketrans(s[i], ' ')
        s = s.translate(d)
print(s)
s = s.replace(" ", "")
s = s.lower()
print(s)       
x = s[::-1]
if( s == x ):
    print("Η πρόταση",s_01,"είναι καρκινική γραφή ή παλίνδρομη.")
else:
    print("Η πρόταση",s_01,"δεν είναι καρκινική γραφή ή παλίνδρομη.")